### Extensions ###


Competative Programming (Personal)
=================================






Web Development (Personal)
==========================
1. Live Server - ritwik dey
2. ES Lint - Dirk Baeumer
3. Prettier - Code formatter - Esben Petersen
4. Turbo Console Log - ChakrounAnas
5. Auto Rename Tag - Jun Han
6. Andromeda - Eliver Lara
7. Auto Import - Steoates
8. Code Spell Checker - Street Side Software
9. JavaScript (ES6) Code Snippets - Charalampos Karypidis
10. npm - Egamma
11. npm Intellisense - Christian Kohler
12. React Extension Pack - Rajbir Jawanda
13. Reactjs code snippets - Charalampos Karypidis
14. Search node_modules - Jason Nutter
15. Tabnine - TabNine
16. Bracket Pair Colorizer - CoenraadS
17. Tailwind CSS IntelliSense - Brad Cornes



Web Development (Others)
========================
1. vscode-icons - VSCode Icons Team
2. Path Autocomplete - Mihai Vilcu
3. ES7 React/Redux/GraphQL/React-Native snippets - dsznajder
4. Dracula Official - Dracula Theme
5. Emoji Snippets - Devzstudio
6. Community Material Theme - Mattia Astorino







July 30, 2021
-----------------
austin.code-gnu-global
bradlc.vscode-tailwindcss
danielpinto8zz6.c-cpp-compile-run
DivyanshuAgrawal.competitive-programming-helper
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
GitHub.copilot
jeff-hykin.better-cpp-syntax
ms-vscode.cpptools
ms-vscode.cpptools-themes
PKief.material-icon-theme
ritwickdey.LiveServer
solnurkarim.html-to-css-autocompletion
SumitSaha.learn-with-sumit-theme
VisualStudioExptTeam.vscodeintellicode
wesbos.theme-cobalt2
