Extensions

1. Live Server - ritwik dey
2. ES Lint - Dirk Baeumer
3. Prettier - Code formatter - Esben Petersen
4. vscode-icons - VSCode Icons Team
5. Path Autocomplete - Mihai Vilcu
6. Turbo Console Log - ChakrounAnas
7. ES7 React/Redux/GraphQL/React-Native snippets - dsznajder
8. Dracula Official - Dracula Theme
9. Auto Rename Tag - Jun Han
10. Andromeda - Eliver Lara
11. Emoji Snippets - Devzstudio
12. Community Material Theme - Mattia Astorino






Important Extension:
auto import
code spell checker
eslint
JavaScript (ES6) code snippets
Prettier - Code formatter
npm
npm Intellisense
React Extension Pack
Reactjs code snippets
Search node_modules
Tabnine
Auto Rename Tag
Bracket Pair Colorizer




July 30, 2021
-----------------
austin.code-gnu-global
bradlc.vscode-tailwindcss
danielpinto8zz6.c-cpp-compile-run
DivyanshuAgrawal.competitive-programming-helper
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-rename-tag
formulahendry.code-runner
GitHub.copilot
jeff-hykin.better-cpp-syntax
ms-vscode.cpptools
ms-vscode.cpptools-themes
PKief.material-icon-theme
ritwickdey.LiveServer
solnurkarim.html-to-css-autocompletion
SumitSaha.learn-with-sumit-theme
VisualStudioExptTeam.vscodeintellicode
wesbos.theme-cobalt2
